11/data/attachments/6d33890cbfcdcd02.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_71a19caf-7aa7-42c1-be50-e2ef7b956cd0</nif:username>
            <nif:friendToBeAdded>Bradley_knowledge_Friend_62324_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>